Autodesk.Revit.DB.ViewShapeBuilder.ValidateCurve(Autodesk.Revit.DB.Curve)
Validates curve to be added to the view-specific shape being constructed. Called by addCurve. Expects a valid view normal to be set prior to the call.
This function may be used to pre-validate the geometry being added to avoid addCurve throwing an InvalidArgumentException
Returns:
True is %GCurve% is acceptable as a part of view-specific shape representation being built.
Validation conditions depend on the type of view for which the shape representation is intended.
For plan views, a curve is expected to be planar and non-degenerate (e.g., NOT a circle of zero radius).
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2015

Autodesk.Revit.DB.ViewShapeBuilder.SetShape(Autodesk.Revit.DB.DirectShapeType)
Set a view-specific shape of the DirectShapeType object to geometry accumulated in this ViewShapeBuilder object.
The view type currently set in ViewShapeBuilder is used. Since the accumulated geometry was validated by ViewShapeBuilder already,
this skips the second validation in DirectShapeType. This function resets this ViewShapeBuilder object: the geometry is transferred to DirectShapeType,
view normal and view type are invalidated.
directShapeType:
The DirectShape object that will have its view-specific shape representation set to a copy of geometry accumulated in this DirectShapeBuilder.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2015

Autodesk.Revit.DB.ViewShapeBuilder.SetShape(Autodesk.Revit.DB.DirectShape)
Set a view-specific shape of the DirectShape object to geometry accumulated in this ViewShapeBuilder object.
The view type currently set in ViewShapeBuilder is used. Since the accumulated geometry was validated by ViewShapeBuilder already,
this skips the second validation in DirectShape. This function resets this ViewShapeBuilder object: the geometry is transferred to DirectShape,
view normal and view type are invalidated.
directShape:
The DirectShape object that will have its view-specific shape representation set to a copy of geometry accumulated in this DirectShapeBuilder.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2015

Autodesk.Revit.DB.ViewShapeBuilder.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014